src/DataProcessors/РабочееМестоУД_Драгметаллы/РабочееМестоУД_Драгметаллы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоУД_Драгметаллы</name>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаПЗ</name>
    <attributes>
      <name>ПЗ</name>
      <type>
        <types>DocumentRef.ПроизводственноеЗадание</types>
      </type>
    </attributes>
    <attributes>
      <name>ДМ1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДМ2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/ДрагоценныеМеталлы/ДрагоценныеМеталлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДрагоценныеМеталлы</name>
  <resources>
    <name>ДМ1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДМ2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДМ3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДМУзел</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/РабочееМестоУД_Драгметаллы/Forms/Форма/Module.bsl
&НаСервере
Процедура ПолучитьЗаданияНаСервере()
Объект.ТаблицаПЗ.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Ссылка,
	|	ДрагоценныеМеталлы.ДМ1,
	|	ДрагоценныеМеталлы.ДМ2
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ДрагоценныеМеталлы КАК ДрагоценныеМеталлы
	|		ПО ПроизводственноеЗадание.Ссылка = ДрагоценныеМеталлы.ПЗ
	|ГДЕ
	|	ПроизводственноеЗадание.Линейка = &Линейка
	|	И ПроизводственноеЗадание.Ссылка.ДатаЗапуска = ДАТАВРЕМЯ(1,1,1,0,0,0)";
Запрос.УстановитьПараметр("Линейка",Объект.Линейка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДМ1) Тогда
		ТЧ = Объект.ТаблицаПЗ.Добавить();
		ТЧ.ПЗ = ВыборкаДетальныеЗаписи.Ссылка;
		ТЧ.ДМ1 = ВыборкаДетальныеЗаписи.ДМ1;
		ТЧ.ДМ2 = ВыборкаДетальныеЗаписи.ДМ2;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЗадания(Команда)
ПолучитьЗаданияНаСервере();
КонецПроцедуры

&НаСервере
Функция ОтчётПоДрагметалламНаСервере()
ТабДок = Новый ТабличныйДокумент;

ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("Макет"); 
ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблМТК = Макет.ПолучитьОбласть("МТК");
ОблПЗ = Макет.ПолучитьОбласть("ПЗ");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ТабДок.Вывести(ОблШапка);
НомерМТК = "";
	Для каждого ТЧ Из Объект.ТаблицаПЗ Цикл
		Если ТЧ.ПЗ.ДокументОснование.Номер <> НомерМТК Тогда
		ОблМТК.Параметры.НомерМТК = ТЧ.ПЗ.ДокументОснование.Номер;
		ОблМТК.Параметры.Наименование = СокрЛП(ТЧ.ПЗ.ДокументОснование.Номенклатура.Наименование);
		ТабДок.Вывести(ОблМТК);	
		НомерМТК = ТЧ.ПЗ.ДокументОснование.Номер;
		КонецЕсли; 
	ОблПЗ.Параметры.НомерПЗ = ТЧ.ПЗ.Номер;
	ТабДок.Вывести(ОблПЗ);
	КонецЦикла; 
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 2;
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура ОтчётПоДрагметаллам(Команда)
ТД = ОтчётПоДрагметалламНаСервере();
ТД.Показать("Отчёт по драгметаллам");
КонецПроцедуры

&НаСервере
Процедура ВнестиВесДрагметалловНаСервере()
	Для каждого ТЧ Из Объект.ТаблицаПЗ Цикл		
	ДМ = РегистрыСведений.ДрагоценныеМеталлы.СоздатьМенеджерЗаписи();
	ДМ.ПЗ = ТЧ.ПЗ; 
	ДМ.ДМ1 = ТЧ.ДМ1;
	ДМ.ДМ2 = ТЧ.ДМ2;
	ДМ.Записать();	
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ВнестиВесДрагметаллов(Команда)
ВнестиВесДрагметалловНаСервере();
ПолучитьЗаданияНаСервере();
КонецПроцедуры

&НаСервере
Функция ПечатьБирокНаСервере()
ТабДок = Новый ТабличныйДокумент;

ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("Бирка"); 
ОблБирка = Макет.ПолучитьОбласть("Бирка");

	Для каждого ТЧ Из Объект.ТаблицаПЗ Цикл 
	ОблБирка.Параметры.НомерПЗ = ТЧ.ПЗ.Номер;
	ТабДок.Вывести(ОблБирка);
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла; 
ТабДок.РазмерСтраницы = "Custom";
ТабДок.ВысотаСтраницы = 13;
ТабДок.ШиринаСтраницы = 45;
ТабДок.ПолеСлева = 0;
ТабДок.ПолеСверху = 0;
ТабДок.ПолеСнизу = 0;
ТабДок.ПолеСправа = 0;
ТабДок.РазмерКолонтитулаСверху = 0;
ТабДок.РазмерКолонтитулаСнизу = 0;
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура ПечатьБирок(Команда)
ТД = ПечатьБирокНаСервере();
ТД.Показать("Бирки");
КонецПроцедуры

&НаСервере
Функция МожноРаботатьВАРМ()
	Если ОбщийМодульВызовСервера.МожноВыполнить(Объект.Линейка) Тогда	
	Возврат(Истина);
	Иначе
	Объект.Линейка = Справочники.Линейки.ПустаяСсылка();
	Сообщить("Работа АРМ запрещена в этой базе!");
	Возврат(Ложь);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЛинейкаПриИзменении(Элемент)
	Если Не МожноРаботатьВАРМ() Тогда	
	Возврат;
	КонецЕсли;
КонецПроцедуры
